In [60]:
import pandas as pd

In [61]:
import numpy as np

In [62]:
from numpy.random import randn

In [63]:
np.random.seed(101)

Create a DataFrame with data, rows, and column names.
The columns are simply pandas series that share a comon index

In [64]:
df = pd.DataFrame(randn(5,4),['A','B','C','D', 'E'], ['W','X', 'Y', 'Z'])

In [65]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Retreive a complete column, returns as Pandas series. We can retreive with key notation df['W'] or dot . notation df.W . This one is not recommended to avoid confusion with method calls.

In [66]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

Retreive multiple colums returns a DataFrame

In [67]:
df[['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

Create new columns by applying operations to de Series

In [75]:
df['new'] = df['W'] + df['X']

In [76]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

Removing columns. Need to specify index so it knows that we're referencing a column and not an index. Also specify inplace argument as True, to make the changes in place.

In [77]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

Above, 'new' columns wasn't removed from the original DataFrame. We need to to specify inplace=True to mutate our original DataFrame

In [80]:
df.drop('new', axis=1, inplace=True)

In [81]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Drop rows. default axis = 0

In [74]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

The rows axis is 0 to be consistent with numpy arrays. The first specified index will refer to the row

Selecting rows. Two ways to do it in DataFrame: 
1. `.loc[key]` method // loc stands for location
2. `.iloc[3]` method // numerical location index

In [82]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [83]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Retreiving single values

In [84]:
df.loc['B', 'Y']

-0.8480769834036315

Returning subsets of DataFrames.
We need to pass a list of rows as a first argument and a list of columns as a second argument.

In [86]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Conditional operations on Data Frames**

In [103]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [91]:
booldf = df > 0

In [92]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

If we pass the booldf to the original df DataFrame we will get a data frame with the values that meet the condition (True)

In [93]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

Conditional on specific columns

In [95]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

**Conditional selection** Filtering rows from specific colum values.
The following line of code will remove the row where column `W` has a negative value or False

In [99]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

...and the opposite

In [100]:
df[df['W']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

One liner notation to filter and retreive a single column:

1. Get a column of booleans out of column `W`
2. Get a DataFrame filtering out the rows in which column `W`s values are False
3. Retreive column `Z` out of that data frame

In [104]:
df[df['W']>0]['Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

**Multiple conditionals**

We can't use python's `and` to evaluate conditional dataFrames or columns against each other.
For pandas we use `&` instead of pythons `and`

In [110]:
(df['Y']>0) & (df['Y']>1)

A    False
B    False
C    False
D    False
E     True
Name: Y, dtype: bool

In [107]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

Same, we can't use python's `or`. We need to use the pipe `|` operator

**reset index**

If we reset index to numeric value, old index will become a column of a new data frame

In [120]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [134]:
df.reset_index()

  index         W         X         Y         Z States
0     A  2.706850  0.628133  0.907969  0.503826     CA
1     B  0.651118 -0.319318 -0.848077  0.605965     NY
2     C -2.018168  0.740122  0.528813 -0.589001     WY
3     D  0.188695 -0.758872 -0.933237  0.955057     OR
4     E  0.190794  1.978757  2.605967  0.683509     CO

In [123]:
df.reset_index()['index']

0    A
1    B
2    C
3    D
4    E
Name: index, dtype: object

In [125]:
newind = 'CA NY WY OR CO'.split()

In [128]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [129]:
df['States'] = newind

In [130]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

Set a column to be the index of the data frame.

If you don't save your previous index, it will be overwritten

In [135]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

**Multilevel Index**